Добавление константы BRANCHING_FACTOR, коэффициент ветвления - атрибут в классе реализующем kнарные деревья.
Добавление константы CACLC_TIMEOUT_SEC, время в серундах через которое вычисление прерывается.
Перемеиновал константу sizeInner в INNER_SIZE.
Добавление константы MAX_VALUE указывающую максимальное возможное значение.
HEADING_FONT_SIZE - Размер шрифта заголовка
PARAGRAPH_FONT_SIZE - Размер шрифта абзаца
TEXT_COLOR - Цвет текста в консоли
VIDEO_SPEED - Стандартная скорость воспроизведения видео
BACKUP_FREQUENCY_DAYS - Частота автоматического бекапа в днях
GREATING - Строка со сообщения приветствия
